<details>
  <summary>
    Output of plan:
  </summary>
  <pre>Acquiring state lock. This may take a few moments...
module.nomad.nomad_job.prometheus_node_exporter: Refreshing state... [id=prometheus-node-exporter]
module.nomad.nomad_external_volume.home_assistant: Refreshing state... [id=home-assistant]
module.nomad.nomad_external_volume.postgres: Refreshing state... [id=postgres]
module.nomad.nomad_job.prometheus_exporter_postgres: Refreshing state... [id=prometheus-exporter-postgres]
module.nomad.nomad_job.ubuntu_upgrade: Refreshing state... [id=ubuntu-upgrade]
module.nomad.nomad_job.nomad_config_backup: Refreshing state... [id=nomad-config-backup]
module.nomad.nomad_external_volume.prometheus: Refreshing state... [id=prometheus]
module.nomad.nomad_job.nomad_gc: Refreshing state... [id=nomad-gc]
module.nomad.nomad_job.docker_gc: Refreshing state... [id=docker-gc]
module.nomad.nomad_external_volume.minio: Refreshing state... [id=minio]
module.nomad.nomad_job.traefik: Refreshing state... [id=traefik]
module.nomad.nomad_job.grafana: Refreshing state... [id=grafana]
module.nomad.nomad_external_volume.bitwarden: Refreshing state... [id=bitwarden]
module.nomad.nomad_job.prometheus: Refreshing state... [id=prometheus]
module.nomad.nomad_job.storage_controller: Refreshing state... [id=storage-controller]
module.nomad.nomad_external_volume.grafana: Refreshing state... [id=grafana]
module.nomad.nomad_job.postgres: Refreshing state... [id=postgres]
module.nomad.nomad_job.postgres_backup: Refreshing state... [id=postgres-backup]
module.nomad.nomad_job.home_assistant: Refreshing state... [id=homeassistant]
module.nomad.nomad_job.minio: Refreshing state... [id=minio]
module.nomad.nomad_job.boundary: Refreshing state... [id=boundary]
module.nomad.nomad_job.journalctl_gc: Refreshing state... [id=journalctl-gc]
module.nomad.nomad_job.bitwarden: Refreshing state... [id=bitwarden]
module.nomad.nomad_job.storage_node: Refreshing state... [id=storage-node]
module.nomad.nomad_job.pihole: Refreshing state... [id=pihole]
module.postgres.random_password.home_assistant: Refreshing state... [id=none]
module.boundary.random_password.david: Refreshing state... [id=none]
module.postgres.random_password.boundary: Refreshing state... [id=none]
module.consul.consul_key_prefix.minio: Refreshing state... [id=homad/minio/]
module.consul.consul_key_prefix.pihole: Refreshing state... [id=homad/pihole/]
module.consul.consul_key_prefix.traefik: Refreshing state... [id=homad/traefik/]
module.consul.consul_key_prefix.prometheus: Refreshing state... [id=homad/prometheus/]
module.consul.consul_key_prefix.postgres: Refreshing state... [id=homad/postgres/]
module.consul.consul_key_prefix.home_assistant: Refreshing state... [id=homad/home-assistant/]
module.minio.minio_s3_bucket.postgres_backups: Refreshing state... [id=postgres-backups]
module.minio.minio_s3_bucket.nomad_backups: Refreshing state... [id=nomad-backups]
module.cloudflare.data.cloudflare_zone.dsb_dev: Reading...
module.tailscale.data.tailscale_devices.nomad_clients: Reading...
module.cloudflare.data.cloudflare_zone.dsb_dev: Read complete after 0s [id=20b0e70bfdf2afacf4abb84547deea0a]
module.tailscale.data.tailscale_device.nas: Reading...
module.grafana.grafana_data_source.prometheus: Refreshing state... [id=2]
module.grafana.grafana_dashboard.traefik: Refreshing state... [id=O23g2BeWk]
module.grafana.grafana_dashboard.minio: Refreshing state... [id=TgmJnqnnk]
module.grafana.grafana_dashboard.nodes: Refreshing state... [id=rYdddlPWk]
module.tailscale.data.tailscale_device.nas: Read complete after 1s [id=33069324248152329]
module.tailscale.data.tailscale_devices.nomad_clients: Read complete after 1s [id=9a1dc7f7-2bbf-08a9-97b5-c9799befaaaf]
module.boundary.boundary_scope.org: Refreshing state... [id=o_LSMnvRZoEE]
module.boundary.boundary_role.global_anon_listing: Refreshing state... [id=r_vjDAfBrCuu]
module.vault.vault_policy.cloudflare_reader: Refreshing state... [id=cloudflare-reader]
module.vault.vault_generic_secret.grafana: Refreshing state... [id=grafana/admin]
module.vault.vault_generic_secret.postgres_root: Refreshing state... [id=postgres/root]
module.vault.vault_generic_secret.cloudflare: Refreshing state... [id=cloudflare/auth]
module.vault.vault_policy.boundary_reader: Refreshing state... [id=boundary-reader]
module.vault.vault_generic_secret.pihole: Refreshing state... [id=pihole/auth]
module.vault.vault_policy.pihole_reader: Refreshing state... [id=pihole-reader]
module.vault.vault_policy.minio_reader: Refreshing state... [id=minio-reader]
module.vault.vault_policy.boundary_credential_store: Refreshing state... [id=boundary-credential-store]
module.vault.vault_policy.postgres_reader: Refreshing state... [id=postgres-reader]
module.vault.vault_generic_secret.boundary_config: Refreshing state... [id=boundary/config]
module.vault.vault_generic_secret.minio: Refreshing state... [id=minio/root]
module.vault.vault_policy.nomad_server: Refreshing state... [id=nomad-server]
module.vault.vault_policy.grafana_reader: Refreshing state... [id=grafana-reader]
module.postgres.postgresql_role.home_assistant: Refreshing state... [id=home_assistant]
module.postgres.postgresql_role.boundary: Refreshing state... [id=boundary]
module.vault.vault_token.boundary: Refreshing state... [id=EDao1u9avcePzVkXDM4PTQMK]
module.boundary.boundary_role.org_anon_listing: Refreshing state... [id=r_1CFYiBj8Zm]
module.boundary.boundary_scope.homad: Refreshing state... [id=p_1lYBOlcTWn]
module.boundary.boundary_auth_method.password: Refreshing state... [id=ampw_yG2wWdzokD]
module.vault.vault_generic_secret.boundary_password: Refreshing state... [id=boundary/david]
module.cloudflare.cloudflare_record.www_nas: Refreshing state... [id=aa607a64c9bc292edb6d073442f7700c]
module.cloudflare.cloudflare_record.nas: Refreshing state... [id=c338f901cad2db1b6954823ea44e3011]
module.cloudflare.cloudflare_record.homelab["100.105.214.9"]: Refreshing state... [id=12a1d62c5c16c63fbcc5fbc753be8415]
module.cloudflare.cloudflare_record.homelab_wildcard["100.88.254.41"]: Refreshing state... [id=133e2da9544bbd1826bacd5dad9037d3]
module.cloudflare.cloudflare_record.homelab["100.76.222.102"]: Refreshing state... [id=afa3d9d6b749647230a2d6dd0ce220b7]
module.cloudflare.cloudflare_record.homelab["100.88.254.41"]: Refreshing state... [id=ae4fc7483dbfc520f646211783e78ec9]
module.cloudflare.cloudflare_record.homelab["100.99.108.54"]: Refreshing state... [id=1c29e5087369373e0aceef81257ea632]
module.cloudflare.cloudflare_record.www_homelab["100.76.222.102"]: Refreshing state... [id=dd3b139c5281fbf3aa8bc3bbcb090f2a]
module.cloudflare.cloudflare_record.homelab_wildcard["100.99.108.54"]: Refreshing state... [id=87ea4d64ca8673c8b001c7b9da2bfe98]
module.cloudflare.cloudflare_record.homelab_wildcard["100.105.214.9"]: Refreshing state... [id=56ff5d6c208899b4690178100fa537af]
module.cloudflare.cloudflare_record.homelab_wildcard["100.76.222.102"]: Refreshing state... [id=b10973dcadec2f217af685046757b4b3]
module.vault.vault_token_auth_backend_role.nomad_cluster: Refreshing state... [id=auth/token/roles/nomad-cluster]
module.cloudflare.cloudflare_record.www_homelab["100.88.254.41"]: Refreshing state... [id=ff070bb85e8aae96401ce6be67198ca3]
module.cloudflare.cloudflare_record.www_homelab["100.99.108.54"]: Refreshing state... [id=fcb7f23d1ab66b70a679874e48d6b7b9]
module.cloudflare.cloudflare_record.www_homelab["100.105.214.9"]: Refreshing state... [id=6559a1eed16e3c399ce0f849da097d84]
module.boundary.boundary_host_catalog.homelab: Refreshing state... [id=hcst_FsyT4pGh2c]
module.boundary.boundary_account.david: Refreshing state... [id=acctpw_Noz85HrkKL]
module.boundary.boundary_credential_store_vault.homad: Refreshing state... [id=csvlt_3wxZlBo3z8]
module.boundary.boundary_host.homelab["100.105.214.9"]: Refreshing state... [id=hst_3aqLqJB3vT]
module.boundary.boundary_host.homelab["100.88.254.41"]: Refreshing state... [id=hst_v0fUAgDVgH]
module.boundary.boundary_host.homelab["100.76.222.102"]: Refreshing state... [id=hst_X0Jace8yLK]
module.boundary.boundary_host.homelab["100.99.108.54"]: Refreshing state... [id=hst_ogZT7HGWhr]
module.boundary.boundary_credential_library_vault.homad: Refreshing state... [id=clvlt_bVHva15vYy]
module.boundary.boundary_user.david: Refreshing state... [id=u_vTlgtxrhqY]
module.boundary.boundary_host_set.homelab: Refreshing state... [id=hsst_AheqgM90sb]
module.postgres.postgresql_database.boundary: Refreshing state... [id=boundary]
module.vault.vault_generic_secret.postgres_boundary: Refreshing state... [id=postgres/boundary]
module.vault.vault_generic_secret.postgres_home_assistant: Refreshing state... [id=postgres/home_assistant]
module.postgres.postgresql_database.home_assistant: Refreshing state... [id=home_assistant]
module.boundary.boundary_role.homad_admin: Refreshing state... [id=r_rmU4cROuhi]
module.boundary.boundary_role.david_admin: Refreshing state... [id=r_a0PzNZxY1j]
module.boundary.boundary_target.homelab: Refreshing state... [id=ttcp_mWubR9mDdM]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.consul.consul_key_prefix.prometheus will be updated in-place
  ~ resource "consul_key_prefix" "prometheus" {
        id          = "homad/prometheus/"
      ~ subkeys     = {
          ~ "prometheus.yml" = <<-EOT
                global:
                  scrape_interval:     1m
                  evaluation_interval: 1m
                
                scrape_configs:
                  # Job that polls the nomad prometheus metric endpoints
                  - job_name: nomad-metrics
                    consul_sd_configs:
                      - server: https://consul.homelab.dsb.dev
                        services: ['nomad-client', 'nomad']
                    relabel_configs:
                      - source_labels: ['__meta_consul_tags']
                        regex: '(.*)http(.*)'
                        action: keep
                    metrics_path: /v1/metrics
                    params:
                      format: ['prometheus']
                
                  # Job that polls the traefik instance's metric endpoints
                  - job_name: traefik-metrics
                    consul_sd_configs:
                      - server: https://consul.homelab.dsb.dev
                        services: ['traefik-metrics']
                    metrics_path: /metrics
                
                  # Job that polls the minio instance's metric endpoint
                  - job_name: minio-metrics
                    consul_sd_configs:
                      - server: https://consul.homelab.dsb.dev
                        services: ['minio-api']
                    metrics_path: /minio/v2/metrics/cluster
                
                  # Job that polls the node-exporter instance's metric endpoint
                  - job_name: node-metrics
                    consul_sd_configs:
                      - server: https://consul.homelab.dsb.dev
                        services: ['node-exporter']
                    metrics_path: /metrics
                
                  # Job that polls the exporter-postgres instance's metric endpoint
                  - job_name: postgres-metrics
                    consul_sd_configs:
                      - server: https://consul.homelab.dsb.dev
                        services: ['prometheus-exporter-postgres']
                    metrics_path: /metrics
              + 
              +   # Job that polls the exporter-pihole instance's metric endpoint
              +   - job_name: pihole-metrics
              +     consul_sd_configs:
              +       - server: https://consul.homelab.dsb.dev
              +         services: ['prometheus-exporter-pihole']
              +     metrics_path: /metrics
            EOT
        }
        # (2 unchanged attributes hidden)
    }

  # module.grafana.grafana_dashboard.nodes will be updated in-place
  ~ resource "grafana_dashboard" "nodes" {
      ~ config_json  = jsonencode(
          ~ {
              ~ iteration            = 1659991501757 -> 1659813895477
              ~ refresh              = "15m" -> "1m"
                tags                 = [
                    "linux",
                ]
              ~ time                 = {
                  ~ from = "now-24h" -> "now-1h"
                    # (1 unchanged element hidden)
                }
                # (16 unchanged elements hidden)
            }
        )
        id           = "rYdddlPWk"
        # (5 unchanged attributes hidden)
    }

  # module.nomad.nomad_job.prometheus_exporter_pihole will be created
  + resource "nomad_job" "prometheus_exporter_pihole" {
      + allocation_ids          = (known after apply)
      + datacenters             = [
          + "homad",
        ]
      + deployment_id           = (known after apply)
      + deployment_status       = (known after apply)
      + deregister_on_destroy   = true
      + deregister_on_id_change = true
      + detach                  = true
      + id                      = (known after apply)
      + jobspec                 = <<-EOT
            job "prometheus-exporter-pihole" {
              region      = "global"
              datacenters = ["homad"]
              type        = "service"
            
              group "prometheus-exporter-pihole" {
                count = 1
            
                network {
                  port "metrics" {
                    to = 9617
                  }
                }
            
                service {
                  name = "prometheus-exporter-pihole"
                  task = "prometheus-exporter-pihole"
                  port = "metrics"
                }
            
                task "prometheus-exporter-pihole" {
                  driver = "docker"
            
                  vault {
                    policies      = ["pihole-reader"]
                    change_mode   = "signal"
                    change_signal = "SIGUSR1"
                  }
            
                  config {
                    image = "ekofr/pihole-exporter:v0.3.0"
                    ports = ["metrics"]
                  }
            
                  template {
                    destination = "local/pihole.env"
                    env         = true
                    data        = <<EOT
            PIHOLE_HOSTNAME={{- range $i, $instance := service "pihole" }}{{ $instance.Address }}{{ if eq $i 0  }},{{end}}{{ end }}
            PIHOLE_PORT={{- range $i, $instance := service "pihole" }}{{ $instance.Port }}{{ if eq $i 0  }},{{end}}{{ end }}
            PIHOLE_PROTOCOL=http
            EOT
                  }
                  template {
                    destination = "secrets/pihole.env"
                    env         = true
                    data        = <<EOT
            {{- with secret "pihole/data/auth" }}
            PIHOLE_PASSWORD={{.Data.data.password}}
            {{ end }}
            EOT
                  }
                }
              }
            }
        EOT
      + modify_index            = (known after apply)
      + name                    = "prometheus-exporter-pihole"
      + namespace               = "default"
      + region                  = "global"
      + task_groups             = [
          + {
              + count   = 1
              + meta    = (known after apply)
              + name    = "prometheus-exporter-pihole"
              + task    = [
                  + {
                      + driver        = "docker"
                      + meta          = (known after apply)
                      + name          = "prometheus-exporter-pihole"
                      + volume_mounts = null
                    },
                ]
              + volumes = null
            },
        ]
      + type                    = "service"
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Warning: Deprecated Resource

  with module.boundary.boundary_account.david,
  on boundary/accounts.tf line 6, in resource "boundary_account" "david":
   6: resource "boundary_account" "david" {

Deprecated: use `resource_account_password` instead.

(and 10 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: .plan

To perform exactly these actions, run the following command to apply:
    terraform apply ".plan"
Releasing state lock. This may take a few moments...
</pre>
</details>